(window.webpackJsonp = window.webpackJsonp || []).push([
  [70],
  {
    R3DY: function (n, t, e) {
      n.exports = (function () {
        "use strict";
        var n = e("+JDR"),
          t = {},
          r = {},
          i = [
            ["アナライズ", "最後に攻撃", "威力*1.3", 1, 0],
            ["いろめがね", "", "こうかはいまひとつの時ダメージ*2", 0, 0],
            ["うるおいボイス", "", "音技が水技になる", 0, 0],
            ["エアロック", "", "天候の効果無効", 0, 0],
            ["エレキスキン", "", "ノーマル技→電気&威力*1.2", 0, 0],
            ["おやこあい", "", "ダメージ1/4の追加攻撃", 0, 0],
            ["かたいツメ", "", "接触技の威力*1.3", 0, 1],
            ["がんじょうあご", "", "牙技の威力*1.5", 0, 1],
            ["きもったま", "", "ゴーストにノーマル/格闘が当たる", 0, 0],
            ["きょううん", "", "急所ランク+1", 0, 0],
            ["げきりゅう", "自分のHPが1/3以下", "水威力*1.5", 0, 1],
            ["ごりむちゅう", "", "攻撃*1.5", 0, 0],
            ["こんじょう", "状態異常", "攻撃*1.5", 0, 1],
            ["サンパワー", "", "ひざしがつよいで特攻*1.5", 0, 0],
            ["しんりょく", "自分のHPが1/3以下", "草威力*1.5", 0, 1],
            ["スカイスキン", "", "ノーマル技→飛行&威力*1.2", 0, 0],
            ["スキルリンク", "", "連続技が5回になる", 0, 0],
            ["すいほう", "", "水技の攻撃/特攻*2", 0, 0],
            ["すてみ", "", "捨て身技の威力*1.2", 0, 1],
            ["すなのちから", "", "砂嵐のとき岩/地面/鋼威力*1.3", 0, 0],
            ["すりぬけ", "", "壁の影響を受けない", 0, 0],
            ["スナイパー", "", "急所命中時に更にダメージ*1.5", 0, 0],
            ["スロースタート", "5ターン以内", "攻撃*0.5", 0, 0],
            ["ちからずく", "", "有利な追加効果がある技の威力*1.3", 0, 1],
            ["ちからもち", "", "物理威力*2", 0, 0],
            ["テクニシャン", "", "威力60以下の技の威力*1.5", 0, 0],
            ["てきおうりょく", "", "タイプ一致補正が*2になる", 0, 0],
            ["てつのこぶし", "", "拳技の威力*1.2", 0, 1],
            ["てんねん", "", "相手のランク補正を無効化", 0, 0],
            ["どくぼうそう", "自分がどく状態", "物理威力*1.5", 0, 1],
            ["トランジスタ", "", "電気技の攻撃/特攻*1.5", 0, 0],
            ["ねつぼうそう", "自分がやけど状態", "特殊威力*1.5", 0, 1],
            ["ノーてんき", "", "天候の効果無効", 0, 0],
            ["ノーマルスキン", "", "技のノーマル化&威力*1.2", 0, 0],
            ["はがねつかい", "", "鋼技の攻撃/特攻*1.5", 0, 0],
            ["はがねのせいしん", "", "鋼技の攻撃*1.5", 0, 0],
            ["はりきり", "", "攻撃*1.5", 0, 0],
            ["パンクロック", "", "音技の威力*1.3", 0, 0],
            ["フェアリースキン", "", "ノーマル技→妖精&威力*1.2", 0, 0],
            ["ふかしのこぶし", "", "直接技がまもるを貫通", 0, 0],
            ["プラス", "マイナスがいる", "特攻*1.5", 0, 1],
            ["フリーズスキン", "", "ノーマル技→氷&威力*1.2", 0, 0],
            ["へんげんじざい", "", "使う技と同じタイプになる", 0, 0],
            ["マイナス", "プラスがいる", "特攻*1.5", 0, 1],
            ["むしのしらせ", "自分のHPが1/3以下", "虫威力*1.5", 0, 1],
            ["メガランチャー", "", "波動技の威力*1.5?", 0, 1],
            ["もうか", "自分のHPが1/3以下", "炎威力*1.5", 0, 1],
            ["もらいび", "もらいび状態", "炎技の攻撃力*1.5", 0, 0],
            ["ヨガパワー", "", "物理威力*2", 0, 0],
            ["よわき", "HPが半分以下", "攻撃/特攻*0.5", 0, 1],
            ["リベロ", "", "使う技と同じタイプになる", 0, 0],
            ["りゅうのあぎと", "", "竜技の攻撃/特攻*1.5", 0, 0],
          ];
        (t.getData = (function () {
          for (var t = {}, e = 0; e < i.length; e++) t[i[e][0]] = e;
          return function (e) {
            if (e in t) return i[t[e]];
            throw new n(e + "に特殊な効果はありません。");
          };
        })()),
          (t.getList = (function () {
            for (var n = [], t = 0; t < i.length; t++) n.push(i[t][0]);
            return function () {
              return n;
            };
          })());
        var o = [
          ["アイスボディ", "", "霰でHP/16回復", 0, 0],
          ["あついしぼう", "", "炎/氷*0.5", 0, 0],
          ["あめうけざら", "", "雨でHP/16回復", 0, 0],
          ["エアロック", "", "天候の効果無効", 0, 0],
          ["カブトアーマー", "", "急所に当たらない", 0, 0],
          ["かんそうはだ", "", "炎威力*1.25/水無効(吸収)", 0, 0],
          ["くさのけがわ", "", "グラスフィールド下で防御*1.5?", 0, 0],
          ["こおりのりんぷん", "", "特殊技ダメージ*0.5", 0, 0],
          ["サンパワー", "", "晴れでHP/8ダメージ", 0, 0],
          ["シェルアーマー", "", "急所に当たらない", 0, 0],
          ["すいほう", "", "炎技の攻撃/特攻*0.5", 0, 0],
          ["たいねつ", "", "炎*0.5", 0, 0],
          ["てんねん", "", "相手のランク補正を無効化", 0, 0],
          ["ノーてんき", "", "天候の効果無効", 0, 0],
          ["ハードロック", "", "こうかはばつぐんの時ダメージ*0.75", 0, 0],
          ["パンクロック", "", "音技のダメージ*0.5", 0, 0],
          ["ファーコート", "", "物理技ダメージ*0.5?", 0, 0],
          ["フィルター", "", "こうかはばつぐんの時ダメージ*0.75", 0, 0],
          ["ふしぎなうろこ", "状態異常", "防御*1.5", 0, 1],
          ["ふゆう", "", "地面を無効化", 0, 0],
          ["ポイズンヒール", "", "毒でHP/8回復", 0, 0],
          ["マルチスケイル", "HPが最大", "!ダメージ*0.5", 0, 1],
          ["もふもふ", "", "直接攻撃ダメージ*0.5、炎技ダメージ*2", 0, 0],
        ];
        return (
          (r.getData = (function () {
            for (var t = {}, e = 0; e < o.length; e++) t[o[e][0]] = e;
            return function (e) {
              if (e in t) return o[t[e]];
              throw new n(e + "に特殊な効果はありません。");
            };
          })()),
          (r.getList = (function () {
            for (var n = [], t = 0; t < o.length; t++) n.push(o[t][0]);
            return function () {
              return n;
            };
          })()),
          { SpecialAttackAbility: t, SpecialDefenceAbility: r }
        );
      })();
    }, 
  }
]);